Autodesk.Revit.DB.KeyBasedTreeEntryTable.GetKeyBasedTreeEntries
Gets the KeyBasedTreeEntries for this table.
Returns:
The KeyBasedTreeEntries for this table.
Since:
2015

Autodesk.Revit.DB.KeyBasedTreeEntryTable.Reload(Autodesk.Revit.DB.KeyBasedTreeEntriesLoadResults)
Reloads KeyBasedTreeEntries from their currently-stored location into this KeyBasedTreeEntryTable.
Remarks:
Revit will try to read KeyBasedTreeEntries from the resource reference stored
within the KeyBasedTreeEntryTable. If the operation fails, the table will be
unchanged.
loadResults:
If provided, Revit will use this object to store any
errors or warnings that were encountered.  Note that if the KeyBasedTreeEntries in the model are
already up to date, no errors or warnings will be added to this object.
This argument may be null.
Returns:
Returns the outcome of the reload operation.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document containing this KeyBasedTreeEntryTable is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document containing this KeyBasedTreeEntryTable is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document containing this KeyBasedTreeEntryTable has no open transaction.
Since:
2015

Autodesk.Revit.DB.KeyBasedTreeEntryTable.LoadFrom(Autodesk.Revit.DB.ExternalResourceReference,Autodesk.Revit.DB.KeyBasedTreeEntriesLoadResults)
Loads KeyBasedTreeEntries from the specified external resource into this KeyBasedTreeEntryTable.
desiredResourceReference:
An external resource reference describing the source of the desired KeyBasedTreeEntry data.
loadResults:
If provided, Revit will use this object to store any
errors or warnings that were encountered.
This argument may be null.
Returns:
Returns whether the operation succeeded or failed.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The server referenced by the ExternalResourceReference does not exist or
does not implement IExternalResourceServer.
-or-
The server referenced by the ExternalResourceReference cannot support the ExternalResourceReferenceType of this KeyBasedTreeEntryTable.
-or-
The ExternalResourceReference (desiredResourceReference) is not in a format
that is supported by its server.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document containing this KeyBasedTreeEntryTable is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document containing this KeyBasedTreeEntryTable is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document containing this KeyBasedTreeEntryTable has no open transaction.
Since:
2015

Autodesk.Revit.DB.KeyBasedTreeEntryTable.ServerSupports(Autodesk.Revit.DB.ExternalResourceReference)
Checks if the server referenced by the given ExternalResourceReference supports the
ExternalResourceReferenceType of this KeyBasedTreeEntryTable.
extRef:
The ExternalResourceReference to check.
Returns:
True if the ExternalResourceReference refers to a server that supports the ExternalResourceReferenceType of this KeyBasedTreeEntryTable.
False otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.KeyBasedTreeEntryTable
KeyBasedTreeEntryTable represents the collection of key-based tree entries for a document.
Since:
2015